Repository: mcadeniran/kipgo_client
Catalog: lib/l10n/app_*.arb
Languages: ru

# language
source: English
ru: Русский

source: Hi
ru: Привет

source: What would you like to do today?
ru: Что хочешь сделать сегодня?

source: Request Ride
ru: Заказать поездку

source: Ride History
ru: История поездок

source: My Profile
ru: Мой профиль

source: Settings
ru: Настройки

source: Test
ru: Тест

# englishEnglish
source: English
ru: Английский

# englishTurkish
source: Turkish
ru: турецкий

# englishRussian
source: Russian
ru: Русский

source: Change Password
ru: Сменить пароль

source: Delete Account
ru: Удалить аккаунт

source: Change Language
ru: Сменить язык

source: Enable Dark Mode
ru: Включить тёмный режим

source: Enable Notifications
ru: Включить уведомления

source: Contact Us
ru: Свяжитесь с нами

# termsAndConditions
source: Terms & Conditions
ru: Условия и положения

source: Log Out
ru: Выйти

# appTitle
source: App
ru: Приложение

# accountTitle
source: Account
ru: Аккаунт

# supportTitle
source: Support
ru: Поддержка

source: Vehicle Details
ru: Данные автомобиля

# usePromoCode
source: Use promo code {promoCode} to get {percentage}% off your next ride!
ru: Используй промокод {promoCode}, чтобы получить скидку {percentage}% на следующую поездку!

# noRideFound
source: Looks like you have no rides yet.
ru: Похоже, у тебя пока нет поездок.

# rideAccepted
source: Accepted
ru: Принято

# rideArrived
source: Driver has arrived
ru: Водитель приехал

# rideOnTrip
source: In Transit
ru: В пути

# rideEnded
source: Completed
ru: Поездка окончена

# rideUnknown
source: Status unknown
ru: Статус неизвестен

source: Call {username}
ru: Позвонить {username}

source: Ride Details
ru: Детали поездки

source: Personal Details
ru: Личные данные

source: Username
ru: Имя пользователя

source: Email
ru: Электронная почта

source: First Name
ru: Имя

source: Surname
ru: Фамилия

source: Phone
ru: Телефон

source: Total Rides Taken
ru: Всего поездок

source: Car Model
ru: Модель автомобиля

source: Colour
ru: Цвет

source: Registration Number
ru: Номер автомобиля

source: Total Rides Driven
ru: Всего поездок

source: Edit Profile
ru: Редактировать профиль

source: Update Profile
ru: Обновить профиль

# firstNameRequiredError
source: Please enter your first name
ru: Пожалуйста, введите имя

# lastNameRequiredError
source: Please enter your surname
ru: Пожалуйста, введите фамилию

# firstNameLengthError
source: Your first name needs at least 2 letters
ru: Ваше имя должно содержать как минимум 2 буквы

# lastNameLengthError
source: Your surname needs at least 2 letters
ru: Ваша фамилия должна содержать как минимум 2 буквы

# phoneNumberRequiredError
source: Please enter your phone number
ru: Пожалуйста, введите номер телефона

# phoneNumberInvalidError
source: Please enter a valid phone number
ru: Пожалуйста, введите правильный номер телефона

# profileUpdateSuccess
source: Your profile has been updated successfully
ru: Ваш профиль успешно обновлён

# profileUpdateFailure
source: There was an error updating your profile:
ru: Произошла ошибка при обновлении профиля:

source: From
ru: Откуда

source: To
ru: Куда

source: Enter Destination
ru: Введите пункт назначения

source: Change Pickup
ru: Изменить пикап

source: Request a Ride
ru: Заказать поездку

source: Set Current Location
ru: Установить текущее местоположение

source: Cancel
ru: Отменить

source: Please wait...
ru: Пожалуйста, подождите...

source: Searching for driver...
ru: Идёт поиск водителя...

source: Call Driver
ru: Позвонить водителю

source: Please enter destination
ru: Пожалуйста, введите пункт назначения

source: Please enter pickup address
ru: Пожалуйста, введите адрес посадки

source: Unknown Address
ru: Неизвестный адрес

source: Driver is coming
ru: Водитель едет

source: Driver has arrived
ru: Водитель приехал

source: Going towards destination
ru: Движение к пункту назначения

source: No available driver nearby
ru: Поблизости нет доступных водителей

source: Go Home
ru: На главный экран

source: Stay
ru: Остаться

source: Ride Completed
ru: Поездка завершена

# yourRideHasEnded
source: Your ride has ended successfully. Do you want to return to the home screen?
ru: Ваша поездка успешно завершена. Хотите вернуться на главный экран?

source: Could not call driver
ru: Не удалось позвонить водителю

source: Available Rides
ru: Доступные поездки

source: My Drives
ru: Мои поездки

source: Currently Offline
ru: Сейчас офлайн

source: You are currently offline
ru: Вы сейчас офлайн

source: Drive
ru: Поездка

source: Drive Details
ru: Детали поездки

# noDrivesYet
source: Looks like you haven’t completed any drives yet
ru: Похоже, вы ещё не завершили ни одной поездки

source: Profile Not Found
ru: Профиль не найден

# vehicleDetailsUpdateSuccess
source: Vehicle details updated successfully
ru: Данные автомобиля успешно обновлены

# vehicleDetailsUpdateFailure
source: Error updating vehicle details
ru: Ошибка при обновлении данных автомобиля

# documentStatus
source: Documents Status
ru: Статус документов

source: Not Submitted
ru: Не отправлено

source: Approved
ru: Одобрено

source: Pending
ru: В ожидании

# modelHint
source: Car Model (e.g. Mercedes C180)
ru: Модель автомобиля (например, Mercedes C180)

# carModelRequired
source: Car model is required
ru: Требуется указать модель автомобиля

# carModelLengthError
source: Car model must be at least 6 characters
ru: Модель автомобиля должна содержать не менее 6 символов

# carColourRequired
source: Car colour is required
ru: Требуется указать цвет автомобиля

# carColourLengthError
source: Car colour must be at least 3 characters
ru: Цвет автомобиля должен содержать не менее 3 символов

source: Licence Number
ru: Номер лицензии

# licenceNumberRequired
source: Licence number is required
ru: Номер лицензии обязателен

# licenceNumberLengthError
source: Licence number must be at least 5 characters
ru: Номер лицензии должен содержать не менее 5 символов

# carRegistrationNumberHint
source: Car Registration Number (e.g AB 123)
ru: Регистрационный номер (например, AB 123)

# carRegistrationNumberRequired
source: Registration number is required
ru: Регистрационный номер обязателен

# carRegistrationNumberLengthError
source: Registration number must be at least 5 characters
ru: Регистрационный номер должен содержать не менее 5 символов

source: Submit Vehicle Details
ru: Отправить данные автомобиля

# yourStatusStaysPending
source: *Your status will stay pending until your vehicle documents are verified.
ru: *Ваш статус останется в ожидании, пока документы автомобиля не будут проверены.

# ifYouUpdateDocument
source: *If you update any documents, your status will return to pending until re-verified.
ru: *Если вы обновите любые документы, ваш статус снова будет в ожидании до повторной проверки.

# thisRideHasBeenAccepted
source: This ride was already accepted by another driver.
ru: Эта поездка уже принята другим водителем.

# yourCurrentLocation
source: Current Position
ru: Текущее местоположение

source: To Pickup
ru: до места посадки

source: Start Trip
ru: Начать поездку

source: End Trip
ru: Завершить поездку

source: Arrived
ru: Я прибыл

source: Welcome Back
ru: С возвращением

source: Forgot Password?
ru: Забыли пароль?

# forgotPasswordTitle
source: Forgot Password
ru: Забыли пароль

source: Login
ru: Войти

source: Sign Up
ru: Зарегистрироваться

# dontHaveAnAccount
source: Don't have an account? Sign Up
ru: Нет аккаунта? Зарегистрироваться

# alreadyHaveAnAccount
source: Already have an account? Sign in
ru: Уже есть аккаунт? Войти

source: Or login with
ru: Или войдите с помощью

source: Sign in with Google
ru: Войти через Google

source: Sign in with Apple
ru: Войти через Apple

source: Use App as
ru: Использовать приложение как

source: Rider
ru: Пассажир

source: Driver
ru: Водитель

# enterAValidEmail
source: Please enter a valid email
ru: Пожалуйста, введите действительный email

# enterMinCharacters
source: Enter at least 8 characters
ru: Введите не менее 8 символов

source: Password
ru: Пароль

source: Register
ru: Зарегистрироваться

source: Username cannot be empty
ru: Имя пользователя не может быть пустым

# usernameLength
source: Username must be at least 3 characters
ru: Имя пользователя должно содержать не менее 3 символов

# enterEmail
source: Enter your email
ru: Введите вашу почту

source: Confirm Password
ru: Подтвердите пароль

# passwordLength
source: Password must be at least 8 characters
ru: Пароль должен содержать не менее 8 символов

source: Passwords do not match
ru: Пароли не совпадают

source: Send Reset Link
ru: Отправить ссылку

# resetPasswordTitle
source: Reset Password
ru: Сброс пароля

# resetPasswordSuccess
source: Password reset email has been sent to {email}.
ru: PПисьмо для сброса пароля было отправлено на {email}.

# resetPasswordInvalidEmail
source: The email address is not valid.
ru: Адрес электронной почты недействителен.

# resetPasswordUserNotFound
source: No user found with this email.
ru: Пользователь с таким email не найден.

# resetPasswordMissingEmail
source: Please enter your email address.
ru: Пожалуйста, введите ваш email.

# resetPasswordGenericError
source: Something went wrong. Please try again.
ru: Что-то пошло не так. Попробуйте еще раз.

# changePasswordTitle
source: Change Password
ru: Изменить пароль

source: Current Password
ru: Текущий пароль

source: New Password
ru: Новый пароль

source: Update Password
ru: Обновить пароль

# passwordChangeSuccess
source: Your password has been updated successfully.
ru: Ваш пароль успешно обновлён.

# incorrectCurrentPassword
source: The current password you entered is incorrect.
ru: Введённый текущий пароль неверен.

# weakPassword
source: Your new password is too weak.
ru: Ваш новый пароль слишком слабый.

# genericError
source: Something went wrong. Please try again.
ru: Что-то пошло не так. Попробуйте еще раз.

# enterCurrentPassword
source: Please enter your current password.
ru: Пожалуйста, введите ваш текущий пароль.

# enterNewPassword
source: Please enter a new password.
ru: Пожалуйста, введите новый пароль.

# enterConfirmPassword
source: Please confirm your password.
ru: Пожалуйста, подтвердите ваш пароль.

source: Edit
ru: Изм

# deleteAccountTitle
source: Delete Account
ru: Удалить аккаунт

# deleteWarning
source: ⚠️ Deleting your account is permanent and cannot be undone.
ru: ⚠️ Удаление аккаунта является окончательным и не может быть отменено.

# enterPassword
source: Enter your password
ru: Введите пароль

# confirmDelete
source: Delete Account
ru: Удалить аккаунт

# deleteSuccess
source: Your account has been deleted successfully.
ru: Ваш аккаунт был успешно удалён.

source: Incorrect password.
ru: Введённый пароль неверен.

# requiresRecentLogin
source: Please log out and log in again before deleting your account.
ru: Для безопасности выйдите из аккаунта и войдите снова, прежде чем удалять его.

# confirmDeleteTitle
source: Confirm Deletion
ru: Подтверждение удаления

# confirmDeleteMessage
source: Are you sure you want to permanently delete your account? This action cannot be undone.
ru: Вы уверены, что хотите навсегда удалить свой аккаунт? Это действие нельзя отменить.

# confirm
source: Yes, Delete
ru: Да, удалить

# profileImageUploadSuccess
source: Profile image uploaded successfully.
ru: Фотография профиля успешно загружена.

# profileImageUploadError
source: Error uploading profile image. Please try again.
ru: Ошибка при загрузке фотографии профиля. Пожалуйста, попробуйте снова.

# profileImageRemoveSuccess
source: Profile image removed successfully.
ru: Фотография профиля успешно удалена.

# profileImageRemoveError
source: Error removing profile image. Please try again.
ru: Ошибка при удалении фотографии профиля. Пожалуйста, попробуйте снова.

source: No file selected.
ru: Файл не выбран.

source: Image uploaded successfully.
ru: Изображение успешно загружено.

# uploadFailed
source: File upload failed. Please try again.
ru: Ошибка загрузки файла. Попробуйте снова.

source: Select File
ru: Выбрать файл

source: Upload File
ru: Загрузить файл

source: Delete File
ru: Удалить файл

source: Preview
ru: Просмотр

# driverLicencePicture
source: Driver's Licence Picture
ru: Фото водительского удостоверения

source: Car with Registration Number Picture
ru: Фото автомобиля с номерным знаком

source: Selfie with Licence
ru: Селфи с водительским удостоверением

# pleaseUploadTheRequired
source: Please upload the required documents to complete your registration:
ru: Пожалуйста, загрузите необходимые документы, чтобы завершить регистрацию:

# sendUsAMessage
source: Send us a message and we'll get back to you soon.
ru: Отправьте нам сообщение, и мы скоро вам ответим.

source: Send
ru: Отправить

source: Message
ru: Сообщение

# messageCannotBeLessThan
source: Message cannot be less than 3 words
ru: Сообщение не может содержать менее 3 слов.

source: Type your message...
ru: Введите ваше сообщение...

# pleaseEnterMessage
source: Please enter a message.
ru: Пожалуйста, введите сообщение.

source: Chat With Us
ru: Чат с нами

source: Support Chat
ru: Чат поддержки

# messageSent
source: Message sent successfully.
ru: Сообщение успешно отправлено.

# messageFailed
source: Failed to send message. Please try again.
ru: Не удалось отправить сообщение. Попробуйте снова.

source: Rate Driver
ru: Оценить водителя

source: Tap to rate
ru: Нажмите, чтобы оценить

# tellUsMore
source: Tell us more (optional)
ru: Расскажите подробнее (необязательно)

source: Enter comment
ru: Введите комментарий

source: Submit
ru: Отправить

# skip
source: Skip for now
ru: Пропустить

# ratingSuccess
source: Rating submitted successfully.
ru: Оценка успешно отправлена.

# ratingError
source: Failed to submit rating. Please try again.
ru: Не удалось отправить оценку. Пожалуйста, попробуйте снова.

source: Now Online
ru: Сейчас в сети

source: Delete Ride
ru: Удалить поездку

source: Delete
ru: Удалить

# areYouSureRide
source: Are you sure you want to delete this ride?
ru: Вы уверены, что хотите удалить эту поездку?

source: Ride deleted successfully
ru: Поездка успешно удалена

source: Error deleting ride:
ru: Ошибка при удалении поездки:

source: Ride not found
ru: Поездка не найдена

# completeProfilePrompt
source: Please complete your profile to start driving.
ru: Пожалуйста, заполните свой профиль, чтобы начать работать водителем.

# submitDocumentsPrompt
source: Please submit the required documents to continue.
ru: Пожалуйста, загрузите необходимые документы, чтобы продолжить.

# documentsPending
source: Your documents are pending verification.
ru: Ваши документы ожидают проверки.

# documentsApproved
source: Your documents have been approved.
ru: Ваши документы одобрены.

# documentsRejected
source: Your documents were rejected. Please re-submit.
ru: Ваши документы отклонены. Пожалуйста, отправьте заново.

source: My Reviews
ru: Мои отзывы

source: reviews
ru: отзывы

# youHaveNoReviews
source: You have no reviews yet
ru: У вас пока нет отзывов

# yourRideWasRejected
source: Your ride was rejected. Please try again.
ru: Ваша поездка была отклонена. Пожалуйста, попробуйте снова.

source: Select Driver
ru: Выберите водителя

# waitingForDriver
source: Waiting for driver response...
ru: Ожидание ответа водителя...

source: Rate Ride
ru: Оценить поездку

# rateYourDriver
source: How was your ride?
ru: Как прошла ваша поездка?

# areYouSureDeleteFile
source: Are you sure you want to delete this file?
ru: Вы уверены, что хотите удалить этот файл?

source: File deleted successfully
ru: Файл успешно удалён

# deleteFailed
source: File deletion failed:
ru: Не удалось удалить файл:

source: Accepted
ru: Принято

source: Rejected
ru: Отклонено

source: Submitted
ru: Отправлено

source: Driver’s Licence
ru: Водительское удостоверение

# uploadAClearPictureofLicence
source: Upload a clear picture of your driver’s licence.
ru: Загрузите четкую фотографию вашего водительского удостоверения.

# ensureYourFullName
source: Ensure your full name and driver’s licence number are visible.
ru: Убедитесь, что ваше полное имя и номер водительского удостоверения видны.

# theDocumentMustBeValid
source: The document must be valid (not expired).
ru: Документ должен быть действительным (не просроченным).

# vehicleRegistration
source: Vehicle Registration (Car Image)
ru: Регистрация транспортного средства (Фото автомобиля)

# uploadAClearPictureOfCar
source: Upload a clear picture of your car showing the number plate.
ru: Загрузите четкую фотографию автомобиля с видимым номерным знаком.

source: The number plate must be readable.
ru: Номерной знак должен быть читаемым.

# theVehicleMustMatch
source: The vehicle must match the details on your profile.
ru: Автомобиль должен соответствовать данным в вашем профиле.

# takeASelfie
source: Take a selfie holding your driver’s licence.
ru: Сделайте селфи, держа водительское удостоверение.

# yourFaceAndTheLicence
source: Your face and the licence details must both be visible.
ru: Ваше лицо и данные удостоверения должны быть видны.

# thisHelpsUsConfirm
source: This helps us confirm the licence truly belongs to you.
ru: Это помогает нам подтвердить, что удостоверение действительно принадлежит вам.

# missingDocuments
source: Upload Missing Documents
ru: Загрузить отсутствующие документы

# documentRejected
source: Resubmit Rejected Documents
ru: Повторно отправить отклонённые документы

source: Status:
ru: Статус:

# removeFile
source: Remove This File
ru: Удалить этот файл

source: Ride is coming
ru: Поездка в пути

source: Fetching ETA...
ru: Получение времени прибытия...

source: On Trip
ru: В поездке

# driverIsWaiting
source: Waiting for you...
ru: Ждёт вас...

source: Arriving in
ru: Прибудет через

source: Reaching destination in
ru: Прибытие к месту назначения через

source: Cancel Ride?
ru: Отменить поездку?

# areYouSureCancelRide
source: Are you sure you want to cancel this ride? The driver will be notified.
ru: Вы уверены, что хотите отменить эту поездку? Водитель будет поставлен в известность.

source: No
ru: Нет

source: Yes Cancel
ru: Да, отменить

source: Background Location Needed
ru: Требуется доступ к местоположению в фоновом режиме

# kipgoNeeds
source: Kipgo needs 'Allow all the time' location access so riders can find you even when the app is closed or running in the background. Please go to settings and enable 'Allow all the time'.
ru: Приложению Kipgo нужен доступ к местоположению «Всегда», чтобы пассажиры могли найти вас даже когда приложение закрыто или работает в фоновом режиме. Пожалуйста, перейдите в настройки и включите «Разрешить всегда».

source: Open Settings
ru: Открыть настройки

source: Location Permission Required
ru: Требуется разрешение на доступ к местоположению

# locationPermissionRequiredDrivers
source: Location permission is required for drivers. Please enable it in Settings.
ru: Для водителей требуется разрешение на доступ к местоположению. Пожалуйста, включите его в настройках.

source: Ride cancelled successfully.
ru: Поездка успешно отменена.

source: Failed to cancel ride:
ru: Не удалось отменить поездку:

source: To Dropoff
ru: К высадке

source: Waiting for rider...
ru: Ожидание пассажира...

source: Cancelled
ru: Отменено

# riderCancelledTrip
source: Rider cancelled the trip.
ru: Пассажир отменил поездку.

source: Ride Cancelled
ru: Поездка отменена

# theRiderHasCancelled
source: The rider has cancelled this trip. You will be redirected to your home screen.
ru: Пассажир отменил эту поездку. Вы будете перенаправлены на главный экран.

source: New Ride Request
ru: Новый запрос на поездку

source: Accept
ru: Принять

source: Ride request is not available
ru: Запрос на поездку недоступен

source: Ride request rejected
ru: Запрос на поездку отклонён

source: Failed to reject ride
ru: Не удалось отклонить поездку

source: Error Processing Ride Request
ru: Ошибка при обработке запроса на поездку

source: Reject
ru: Отклонить
